/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_make_command.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mlaureen <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/03/20 07:37:09 by mlaureen          #+#    #+#             */
/*   Updated: 2021/03/29 11:10:41 by sabra            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_minishell.h"
#include "stdio.h"
/*
void	ft_make_command(t_cmd *ar_t_cmd, int len)
{
	int		i;
	i = 0;
	while(i < len)
	
		//  обработка t_cmd в массив для отправики в команду
		
		i++;
	}
	return ;
}
*/
